       77  WRK-VENDAS                  PIC 9(006)V99   VALUE ZEROS.
       77  WRK-QTD                     PIC 9(003)      VALUE ZEROS.
       77  WRK-ACUMULADOR-VENDAS       PIC 9(008)V99   VALUE ZEROS.
